app/views/visit_templates/_form.html.erb

    <label>Fee Schedule</label>
      <%= form.select :fee_schedule_id, options_for_select(@fee_schedules.map{|s| [s.name,s.id] }, @visit_template.fee_schedule_id) %>
---
SELECT "fee_schedules".* FROM "fee_schedules"

    <div class="select select-multiple">
      <%= select_tag 'terminologies[]', options_for_select(@terminologies.map{|s| [s.code+'('+s.description+')',s.id] },
                                                           @visit_template.template_terminologies.pluck(:terminology_id)), multiple: true, size: 10 %>
---
SELECT COUNT(*) FROM "template_terminologies" WHERE "template_terminologies"."visit_template_id" = $1  [["visit_template_id", 1]]
SELECT "terminologies"."id", "terminologies"."code" FROM "terminologies"
SELECT "template_terminologies"."terminology_id" FROM "template_terminologies" WHERE "template_terminologies"."visit_template_id" = $1  [["visit_template_id", 5]]