app/views/visit_templates/add_units.html.erb

    <%# debugger %>
    <label>Units for <%= Terminology.find(tt.object.terminology_id.to_i).code %></label>
---
SELECT "terminologies".* FROM "terminologies" WHERE "terminologies"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]