app/views/visit_templates/index.html.erb

SELECT "template_terminologies"."terminology_id" FROM "template_terminologies" WHERE "template_terminologies"."visit_template_id" = $1  [["visit_template_id", 1]]
SELECT "terminologies".* FROM "terminologies" WHERE "terminologies"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
        <td>
          <% visit_template.template_terminologies.pluck(:terminology_id).each do |terminology| %>
              <%= Terminology.find(terminology).code %><br/>