app/views/terminologies/_form.html.erb

        else
          if TerminologyFeeSchedule.where(terminology_id: @terminology.id, fee_schedule_id: fs.id).exists?
            tfs = TerminologyFeeSchedule.where(terminology_id: @terminology.id, fee_schedule_id: fs.id).last.value
---
SELECT "terminology_fee_schedules".* FROM "terminology_fee_schedules" WHERE "terminology_fee_schedules"."terminology_id" = $1 AND "terminology_fee_schedules"."fee_schedule_id" = $2 ORDER BY "terminology_fee_schedules"."id" DESC LIMIT $3  [["terminology_id", 5], ["fee_schedule_id", 1], ["LIMIT", 1]]
SELECT 1 AS one FROM "terminology_fee_schedules" WHERE "terminology_fee_schedules"."terminology_id" = $1 AND "terminology_fee_schedules"."fee_schedule_id" = $2 LIMIT $3  [["terminology_id", 2], ["fee_schedule_id", 1], ["LIMIT", 1]]