app/controllers/cost_estimates_controller.rb

SELECT "terminologies".* FROM "terminologies" WHERE "terminologies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "terminology_fee_schedules".* FROM "terminology_fee_schedules" WHERE "terminology_fee_schedules"."terminology_id" = $1 AND "terminology_fee_schedules"."fee_schedule_id" = $2 ORDER BY "terminology_fee_schedules"."id" ASC LIMIT $3  [["terminology_id", 2], ["fee_schedule_id", 2], ["LIMIT", 1]]
---
  def populate_terminology_fields_temp
    @terminology = Terminology.find(params[:terminology_id])
    if params[:fee_schedule_id].blank?
      @terminology_fee_schedule = TerminologyFeeSchedule.where(terminology_id: @terminology.id).first