app/controllers/cost_estimates_controller.rb

  def new
    @terminologies = Terminology.all
---
SELECT "terminologies".* FROM "terminologies"

  def populate_terminologies
    unless params[:visit_template_id].blank?
      @next_available_fcs = 1
      @next_available_cs = 1
      @next_available_ncs = 1

      @template_terminologies = TemplateTerminology.where(visit_template_id: params[:visit_template_id].to_i)
      @terminologies = Terminology.where(id: @template_terminologies.pluck(:terminology_id))
      @fee_schedule = VisitTemplate.find(params[:visit_template_id].to_i).fee_schedule_id
---
SELECT "template_terminologies".* FROM "template_terminologies" WHERE "template_terminologies"."terminology_id" = $1 AND "template_terminologies"."visit_template_id" = $2 ORDER BY "template_terminologies"."id" ASC LIMIT $3  [["terminology_id", 2], ["visit_template_id", 1], ["LIMIT", 1]]
SELECT "template_terminologies"."terminology_id" FROM "template_terminologies" WHERE "template_terminologies"."visit_template_id" = $1  [["visit_template_id", 1]]
SELECT "visit_templates".* FROM "visit_templates" WHERE "visit_templates"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "fee_schedules".* FROM "fee_schedules" WHERE "fee_schedules"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def populate_charges
    @template_terminologies = TemplateTerminology.where(visit_template_id: params[:visit_template_id].to_i)
    @terminologies = Terminology.where(id: @template_terminologies.pluck(:terminology_id))
    @fee_schedule = params[:fee_schedule_id].to_i

    if params[:terminology_fcs1].present?
      @fcs_charge1 = TerminologyFeeSchedule.where(
        terminology_id: params[:terminology_fcs1], fee_schedule_id: @fee_schedule).first.value
      if (@fcs_charge1 > 0 && params[:terminology_fcs2].present?)
        @fcs_charge2 = TerminologyFeeSchedule.where(
          terminology_id: params[:terminology_fcs2], fee_schedule_id: @fee_schedule).first.value

        if (@fcs_charge2 > 0 && params[:terminology_fcs3].present?)
          @fcs_charge3 = TerminologyFeeSchedule.where(
            terminology_id: params[:terminology_fcs3],
            fee_schedule_id: @fee_schedule).first.value
        end
      end
    end

    if params[:terminology_cs1].present?
      @cs_charge1 = TerminologyFeeSchedule.where(
        terminology_id: params[:terminology_cs1],fee_schedule_id: @fee_schedule).first.value
---
SELECT "terminology_fee_schedules".* FROM "terminology_fee_schedules" WHERE "terminology_fee_schedules"."terminology_id" = $1 AND "terminology_fee_schedules"."fee_schedule_id" = $2 ORDER BY "terminology_fee_schedules"."id" ASC LIMIT $3  [["terminology_id", 1], ["fee_schedule_id", 1], ["LIMIT", 1]]
SELECT "terminology_fee_schedules".* FROM "terminology_fee_schedules" WHERE "terminology_fee_schedules"."terminology_id" = $1 AND "terminology_fee_schedules"."fee_schedule_id" = $2 ORDER BY "terminology_fee_schedules"."id" ASC LIMIT $3  [["terminology_id", 9], ["fee_schedule_id", 1], ["LIMIT", 1]]
SELECT "terminology_fee_schedules".* FROM "terminology_fee_schedules" WHERE "terminology_fee_schedules"."terminology_id" = $1 AND "terminology_fee_schedules"."fee_schedule_id" = $2 ORDER BY "terminology_fee_schedules"."id" ASC LIMIT $3  [["terminology_id", 3], ["fee_schedule_id", 1], ["LIMIT", 1]]

  def populate_terminology_fields
    @terminology_type = params[:terminology_type]
    @terminology = Terminology.find(params[:terminology_id])
    if params[:fee_schedule_id].blank?
      @terminology_fee_schedule = TerminologyFeeSchedule.where(terminology_id: @terminology.id).first
---
SELECT "terminology_fee_schedules".* FROM "terminology_fee_schedules" WHERE "terminology_fee_schedules"."terminology_id" = $1 AND "terminology_fee_schedules"."fee_schedule_id" = $2 ORDER BY "terminology_fee_schedules"."id" ASC LIMIT $3  [["terminology_id", 2], ["fee_schedule_id", 2], ["LIMIT", 1]]

  def populate_terminology_fields_for_selected
    @terminology = Terminology.find(params[:terminology_id])
    if params[:fee_schedule_id].blank?
      @terminology_fee_schedule = TerminologyFeeSchedule.where(terminology_id: @terminology.id).first
    else
      @terminology_fee_schedule = TerminologyFeeSchedule.where(terminology_id: @terminology.id, fee_schedule_id: params[:fee_schedule_id]).first
---
SELECT "terminologies".* FROM "terminologies" WHERE "terminologies"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "terminology_fee_schedules".* FROM "terminology_fee_schedules" WHERE "terminology_fee_schedules"."terminology_id" = $1 AND "terminology_fee_schedules"."fee_schedule_id" = $2 ORDER BY "terminology_fee_schedules"."id" ASC LIMIT $3  [["terminology_id", 2], ["fee_schedule_id", 2], ["LIMIT", 1]]