app/controllers/cost_estimates_controller.rb

  def index
    @cost_estimates = CostEstimate.all
---
SELECT "cost_estimates".* FROM "cost_estimates"

  def new
    @terminologies_fcs = Terminology.where(coverage_type: 'Fully Covered Service')
    @terminologies_cs = Terminology.where(coverage_type: 'Covered Service')
    @terminologies_ncs = Terminology.where(coverage_type: 'Non-Covered Service')
    @visit_templates = VisitTemplate.all
    @fee_schedules = FeeSchedule.all
---
SELECT "terminologies".* FROM "terminologies" WHERE "terminologies"."coverage_type" = $1  [["coverage_type", "Fully Covered Service"]]
SELECT "visit_templates".* FROM "visit_templates"
SELECT "fee_schedules".* FROM "fee_schedules"

  def create
    @cost_estimate = CostEstimate.new(cost_estimate_params)

    respond_to do |format|
      if @cost_estimate.save
---
INSERT INTO "cost_estimates" ("patient_name", "date_of_appointment", "plan_name", "plan_type", "visit_template_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def populate_terminologies
    @template_terminologies = TemplateTerminology.where(visit_template_id: params[:visit_template_id].to_i)
    @terminologies = Terminology.where(id: @template_terminologies.pluck(:terminology_id))
    @fee_schedule = VisitTemplate.find(params[:visit_template_id].to_i)

    @fcs1 = @terminologies.where(coverage_type: 'Fully Covered Service').first
    @fcs2 = @terminologies.where(coverage_type: 'Fully Covered Service').second
    @fcs3 = @terminologies.where(coverage_type: 'Fully Covered Service').third

    @cs1 = @terminologies.where(coverage_type: 'Covered Service').first
    @cs2 = @terminologies.where(coverage_type: 'Covered Service').second
    @cs3 = @terminologies.where(coverage_type: 'Covered Service').third

    @ncs1 = @terminologies.where(coverage_type: 'Non-Covered Service').first
    @ncs2 = @terminologies.where(coverage_type: 'Non-Covered Service').second
    @ncs3 = @terminologies.where(coverage_type: 'Non-Covered Service').third

    if @terminologies.where(coverage_type: 'Fully Covered Service').count > 0
      @fcs_charge1 = TerminologyFeeSchedule.where(
        terminology_id: @terminologies.where(coverage_type: 'Fully Covered Service').first.id,
        fee_schedule_id: @fee_schedule.id).first.value
      @fcs_units1 = TemplateTerminology.where(
        terminology_id: @terminologies.where(coverage_type: 'Fully Covered Service').first.id,
        visit_template_id: params[:visit_template_id].to_i
      ).first.units

      if (@fcs_charge1 > 0 && @terminologies.where(coverage_type: 'Fully Covered Service').count > 1)
---
SELECT "template_terminologies".* FROM "template_terminologies" WHERE "template_terminologies"."terminology_id" = $1 AND "template_terminologies"."visit_template_id" = $2 ORDER BY "template_terminologies"."id" ASC LIMIT $3  [["terminology_id", 2], ["visit_template_id", 1], ["LIMIT", 1]]
SELECT "template_terminologies"."terminology_id" FROM "template_terminologies" WHERE "template_terminologies"."visit_template_id" = $1  [["visit_template_id", 1]]
SELECT "visit_templates".* FROM "visit_templates" WHERE "visit_templates"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "terminologies".* FROM "terminologies" WHERE "terminologies"."id" IN ($1, $2, $3, $4, $5, $6) AND "terminologies"."coverage_type" = $7 ORDER BY "terminologies"."id" ASC LIMIT $8 OFFSET $9  [["id", 2], ["id", 1], ["id", 3], ["id", 5], ["id", 9], ["id", 8], ["coverage_type", "Fully Covered Service"], ["LIMIT", 1], ["OFFSET", 2]]
SELECT "terminologies".* FROM "terminologies" WHERE "terminologies"."id" IN ($1, $2, $3, $4, $5, $6) AND "terminologies"."coverage_type" = $7 ORDER BY "terminologies"."id" ASC LIMIT $8 OFFSET $9  [["id", 2], ["id", 1], ["id", 3], ["id", 5], ["id", 9], ["id", 8], ["coverage_type", "Covered Service"], ["LIMIT", 1], ["OFFSET", 1]]
SELECT "terminologies".* FROM "terminologies" WHERE "terminologies"."id" IN ($1, $2, $3, $4, $5, $6) AND "terminologies"."coverage_type" = $7 ORDER BY "terminologies"."id" ASC LIMIT $8 OFFSET $9  [["id", 2], ["id", 1], ["id", 3], ["id", 5], ["id", 9], ["id", 8], ["coverage_type", "Covered Service"], ["LIMIT", 1], ["OFFSET", 2]]
SELECT "terminologies".* FROM "terminologies" WHERE "terminologies"."id" IN ($1, $2, $3, $4, $5, $6) AND "terminologies"."coverage_type" = $7 ORDER BY "terminologies"."id" ASC LIMIT $8 OFFSET $9  [["id", 2], ["id", 1], ["id", 3], ["id", 5], ["id", 9], ["id", 8], ["coverage_type", "Non-Covered Service"], ["LIMIT", 1], ["OFFSET", 1]]
SELECT "terminologies".* FROM "terminologies" WHERE "terminologies"."id" IN ($1, $2, $3, $4, $5, $6) AND "terminologies"."coverage_type" = $7 ORDER BY "terminologies"."id" ASC LIMIT $8 OFFSET $9  [["id", 2], ["id", 1], ["id", 3], ["id", 5], ["id", 9], ["id", 8], ["coverage_type", "Non-Covered Service"], ["LIMIT", 1], ["OFFSET", 2]]
SELECT COUNT(*) FROM "terminologies" WHERE "terminologies"."id" IN ($1, $2, $3, $4, $5, $6) AND "terminologies"."coverage_type" = $7  [["id", 2], ["id", 1], ["id", 3], ["id", 5], ["id", 9], ["id", 8], ["coverage_type", "Fully Covered Service"]]
SELECT "terminologies".* FROM "terminologies" WHERE "terminologies"."id" IN ($1, $2, $3, $4, $5, $6) AND "terminologies"."coverage_type" = $7 ORDER BY "terminologies"."id" ASC LIMIT $8 OFFSET $9  [["id", 2], ["id", 1], ["id", 3], ["id", 5], ["id", 9], ["id", 8], ["coverage_type", "Fully Covered Service"], ["LIMIT", 1], ["OFFSET", 1]]

  def populate_charges
    @template_terminologies = TemplateTerminology.where(visit_template_id: params[:visit_template_id].to_i)
    @terminologies = Terminology.where(id: @template_terminologies.pluck(:terminology_id))
    @fee_schedule = VisitTemplate.find(params[:visit_template_id].to_i)
    # @fee_schedule = FeeSchedule.find(params[:fee_schedule_id].to_i)

    @fcs_charge1 = TerminologyFeeSchedule.where(
      terminology_id: @terminologies.where(coverage_type: 'Fully Covered Service').first.id,
      fee_schedule_id: @fee_schedule.id).first.value
    if (@fcs_charge1 > 0 && @terminologies.where(coverage_type: 'Fully Covered Service').count > 1)
      @fcs_charge2 = TerminologyFeeSchedule.where(
      terminology_id: @terminologies.where(coverage_type: 'Fully Covered Service').second.id,
      fee_schedule_id: @fee_schedule.id).first.value

      if (@fcs_charge2 > 0 && @terminologies.where(coverage_type: 'Fully Covered Service').count > 2)
        @fcs_charge3 = TerminologyFeeSchedule.where(
          terminology_id: @terminologies.where(coverage_type: 'Fully Covered Service').third.id,
          fee_schedule_id: @fee_schedule.id).first.value
      end
    end

    @cs_charge1 = TerminologyFeeSchedule.where(
      terminology_id: @terminologies.where(coverage_type: 'Covered Service').first.id,
      fee_schedule_id: @fee_schedule.id).first.value
    if (@cs_charge1 > 0 && @terminologies.where(coverage_type: 'Covered Service').count > 1)
      @cs_charge2 = TerminologyFeeSchedule.where(
      terminology_id: @terminologies.where(coverage_type: 'Covered Service').second.id,
      fee_schedule_id: @fee_schedule.id).first.value

      if (@cs_charge2 > 0 && @terminologies.where(coverage_type: 'Covered Service').count > 2)
---
SELECT "template_terminologies".* FROM "template_terminologies" WHERE "template_terminologies"."terminology_id" = $1 AND "template_terminologies"."visit_template_id" = $2 ORDER BY "template_terminologies"."id" ASC LIMIT $3  [["terminology_id", 3], ["visit_template_id", 1], ["LIMIT", 1]]
SELECT "template_terminologies"."terminology_id" FROM "template_terminologies" WHERE "template_terminologies"."visit_template_id" = $1  [["visit_template_id", 0]]
SELECT "visit_templates".* FROM "visit_templates" WHERE "visit_templates"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
SELECT COUNT(*) FROM "terminologies" WHERE "terminologies"."id" IN ($1, $2, $3, $4, $5, $6) AND "terminologies"."coverage_type" = $7  [["id", 2], ["id", 1], ["id", 3], ["id", 5], ["id", 9], ["id", 8], ["coverage_type", "Fully Covered Service"]]
SELECT "terminologies".* FROM "terminologies" WHERE "terminologies"."id" IN ($1, $2, $3, $4, $5, $6) AND "terminologies"."coverage_type" = $7 ORDER BY "terminologies"."id" ASC LIMIT $8 OFFSET $9  [["id", 2], ["id", 1], ["id", 3], ["id", 5], ["id", 9], ["id", 8], ["coverage_type", "Fully Covered Service"], ["LIMIT", 1], ["OFFSET", 1]]
SELECT "terminologies".* FROM "terminologies" WHERE "terminologies"."id" IN ($1, $2, $3, $4, $5, $6) AND "terminologies"."coverage_type" = $7 ORDER BY "terminologies"."id" ASC LIMIT $8 OFFSET $9  [["id", 2], ["id", 1], ["id", 3], ["id", 5], ["id", 9], ["id", 8], ["coverage_type", "Fully Covered Service"], ["LIMIT", 1], ["OFFSET", 2]]
SELECT COUNT(*) FROM "terminologies" WHERE "terminologies"."id" IN ($1, $2, $3, $4, $5, $6) AND "terminologies"."coverage_type" = $7  [["id", 2], ["id", 1], ["id", 3], ["id", 5], ["id", 9], ["id", 8], ["coverage_type", "Covered Service"]]
SELECT "terminologies".* FROM "terminologies" WHERE "terminologies"."id" IN ($1, $2, $3, $4, $5, $6) AND "terminologies"."coverage_type" = $7 ORDER BY "terminologies"."id" ASC LIMIT $8 OFFSET $9  [["id", 2], ["id", 1], ["id", 3], ["id", 5], ["id", 9], ["id", 8], ["coverage_type", "Covered Service"], ["LIMIT", 1], ["OFFSET", 1]]
SELECT "terminologies".* FROM "terminologies" WHERE "terminologies"."id" IN ($1, $2, $3, $4, $5, $6) AND "terminologies"."coverage_type" = $7 ORDER BY "terminologies"."id" ASC LIMIT $8  [["id", 2], ["id", 1], ["id", 3], ["id", 5], ["id", 9], ["id", 8], ["coverage_type", "Non-Covered Service"], ["LIMIT", 1]]

  def populate_terminology_fields
    @terminology = Terminology.find(params[:terminology_id])
    @terminology_fee_schedule = TerminologyFeeSchedule.where(terminology_id: @terminology.id).first
---
SELECT "terminologies".* FROM "terminologies" WHERE "terminologies"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "terminology_fee_schedules".* FROM "terminology_fee_schedules" WHERE "terminology_fee_schedules"."terminology_id" = $1 ORDER BY "terminology_fee_schedules"."id" ASC LIMIT $2  [["terminology_id", 2], ["LIMIT", 1]]

    def set_cost_estimate
      @cost_estimate = CostEstimate.find(params[:id])
---
SELECT "cost_estimates".* FROM "cost_estimates" WHERE "cost_estimates"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]