app/controllers/fee_schedules_controller.rb

SELECT "fee_schedules".* FROM "fee_schedules"
---
  def index
    @fee_schedules = FeeSchedule.all

INSERT INTO "fee_schedules" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Medicare"], ["created_at", "2022-01-18 07:45:50.780335"], ["updated_at", "2022-01-18 07:45:50.780335"]]
---
  def create
    @fee_schedule = FeeSchedule.new(fee_schedule_params)

    respond_to do |format|
      if @fee_schedule.save

SELECT "fee_schedules".* FROM "fee_schedules" WHERE "fee_schedules"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_fee_schedule
      @fee_schedule = FeeSchedule.find(params[:id])