app/controllers/terminologies_controller.rb

    def set_terminology
      @terminology = Terminology.find(params[:id])
---
SELECT "terminologies".* FROM "terminologies" WHERE "terminologies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]