app/controllers/terminologies_controller.rb

  def index
    @terminologies = Terminology.all
---
SELECT "terminologies".* FROM "terminologies"

  def new
    @terminology = Terminology.new
    @fee_schedules = FeeSchedule.all
---
SELECT "fee_schedules".* FROM "fee_schedules"

  def edit
    @fee_schedules = FeeSchedule.all
---
SELECT "fee_schedules".* FROM "fee_schedules"

  def create
    @terminology = Terminology.new(terminology_params)
    respond_to do |format|
      if @terminology.save
        @fee_schedules = FeeSchedule.all

        @fee_schedules.each do |fs|
          tfs = TerminologyFeeSchedule.where(terminology_id: @terminology.id, fee_schedule_id: fs.id)
          if tfs.exists?
            tfs.first.update_columns(value: params[fs.name])
          else
            TerminologyFeeSchedule.create!(terminology_id: @terminology.id, fee_schedule_id: fs.id, value: params[fs.name])
---
INSERT INTO "terminologies" ("code", "description", "modifier", "charge", "created_at", "updated_at", "coverage_type") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
SELECT "fee_schedules".* FROM "fee_schedules"
SELECT "terminology_fee_schedules".* FROM "terminology_fee_schedules" WHERE "terminology_fee_schedules"."terminology_id" = $1 AND "terminology_fee_schedules"."fee_schedule_id" = $2  [["terminology_id", 7], ["fee_schedule_id", 1]]
SELECT 1 AS one FROM "terminology_fee_schedules" WHERE "terminology_fee_schedules"."terminology_id" = $1 AND "terminology_fee_schedules"."fee_schedule_id" = $2 LIMIT $3  [["terminology_id", 9], ["fee_schedule_id", 1], ["LIMIT", 1]]
UPDATE "terminologies" SET "coverage_type" = $1, "updated_at" = $2 WHERE "terminologies"."id" = $3  [["coverage_type", "Non-Covered Services"], ["updated_at", "2022-01-11 09:45:31.386542"], ["id", 1]]
SELECT "terminology_fee_schedules".* FROM "terminology_fee_schedules" WHERE "terminology_fee_schedules"."terminology_id" = $1 AND "terminology_fee_schedules"."fee_schedule_id" = $2 LIMIT $3  [["terminology_id", 5], ["fee_schedule_id", 1], ["LIMIT", 11]]
INSERT INTO "terminology_fee_schedules" ("terminology_id", "fee_schedule_id", "value", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["terminology_id", 9], ["fee_schedule_id", 1], ["value", 23.0], ["created_at", "2022-01-19 11:51:21.165244"], ["updated_at", "2022-01-19 11:51:21.165244"]]

  def update
    respond_to do |format|
      if @terminology.update(terminology_params)
        @fee_schedules = FeeSchedule.all

        @fee_schedules.each do |fs|
          tfs = TerminologyFeeSchedule.where(terminology_id: @terminology.id, fee_schedule_id: fs.id)
          if tfs.exists?
            tfs.first.update_columns(value: params[fs.name])
          else
            TerminologyFeeSchedule.create!(terminology_id: @terminology.id, fee_schedule_id: fs.id, value: params[fs.name])
---
UPDATE "terminologies" SET "code" = $1, "description" = $2, "updated_at" = $3 WHERE "terminologies"."id" = $4  [["code", "fully cpt2"], ["description", "fully cpt2 description"], ["updated_at", "2022-01-18 13:09:21.374059"], ["id", 5]]
SELECT "fee_schedules".* FROM "fee_schedules"
SELECT "terminology_fee_schedules".* FROM "terminology_fee_schedules" WHERE "terminology_fee_schedules"."terminology_id" = $1 AND "terminology_fee_schedules"."fee_schedule_id" = $2 ORDER BY "terminology_fee_schedules"."id" ASC LIMIT $3  [["terminology_id", 1], ["fee_schedule_id", 1], ["LIMIT", 1]]
SELECT 1 AS one FROM "terminology_fee_schedules" WHERE "terminology_fee_schedules"."terminology_id" = $1 AND "terminology_fee_schedules"."fee_schedule_id" = $2 LIMIT $3  [["terminology_id", 3], ["fee_schedule_id", 1], ["LIMIT", 1]]
SELECT "terminology_fee_schedules".* FROM "terminology_fee_schedules" WHERE "terminology_fee_schedules"."terminology_id" = $1 AND "terminology_fee_schedules"."fee_schedule_id" = $2 ORDER BY "terminology_fee_schedules"."id" ASC LIMIT $3  [["terminology_id", 2], ["fee_schedule_id", 1], ["LIMIT", 1]]
UPDATE "terminology_fee_schedules" SET "value" = $1 WHERE "terminology_fee_schedules"."id" = $2  [["value", 1.0], ["id", 1]]
INSERT INTO "terminology_fee_schedules" ("terminology_id", "fee_schedule_id", "value", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["terminology_id", 3], ["fee_schedule_id", 1], ["value", 11.0], ["created_at", "2022-01-18 10:50:24.926408"], ["updated_at", "2022-01-18 10:50:24.926408"]]

    def set_terminology
      @terminology = Terminology.find(params[:id])
---
SELECT "terminologies".* FROM "terminologies" WHERE "terminologies"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]