app/controllers/visit_templates_controller.rb

SELECT "fee_schedules".* FROM "fee_schedules"
---
  def new
    @terminologies = Terminology.all
    @fee_schedules = FeeSchedule.all

SELECT "fee_schedules".* FROM "fee_schedules"
---
  def edit
    @terminologies = Terminology.all
    @fee_schedules = FeeSchedule.all

SELECT 1 AS one FROM "template_terminologies" WHERE "template_terminologies"."visit_template_id" = $1 AND "template_terminologies"."terminology_id" = $2 LIMIT $3  [["visit_template_id", 5], ["terminology_id", 2], ["LIMIT", 1]]
SELECT "template_terminologies".* FROM "template_terminologies" WHERE "template_terminologies"."visit_template_id" = $1 LIMIT $2  [["visit_template_id", 1], ["LIMIT", 11]]
---
  def update
    @terminologies = Terminology.all
    @fee_schedules = FeeSchedule.all
    respond_to do |format|
      if @visit_template.update(visit_template_params)

        unless params[:terminologies].nil?
          # TemplateTerminology.where(visit_template_id: @visit_template.id).destroy_all
          params[:terminologies].each do |tt|
            unless TemplateTerminology.where(visit_template_id: @visit_template.id, terminology_id: tt.to_i).exists?
              TemplateTerminology.where(visit_template_id: @visit_template.id, terminology_id: tt.to_i).first_or_create

SELECT "visit_templates".* FROM "visit_templates" WHERE "visit_templates"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
    def set_visit_template
      @visit_template = VisitTemplate.find(params[:id])