app/controllers/visit_templates_controller.rb

  def index
    @visit_templates = VisitTemplate.all
---
SELECT "visit_templates".* FROM "visit_templates"

  def new
    @terminologies = Terminology.all
---
SELECT "terminologies".* FROM "terminologies"

  def edit
    @terminologies = Terminology.all
---
SELECT "terminologies".* FROM "terminologies"

  def create
    @visit_template = VisitTemplate.new(visit_template_params)
    respond_to do |format|
      if @visit_template.save
        params[:terminologies].each do |tt|
          TemplateTerminology.where(visit_template_id: @visit_template.id, terminology_id: tt.to_i).first_or_create
---
INSERT INTO "visit_templates" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "bbb"], ["created_at", "2022-01-11 11:10:05.137918"], ["updated_at", "2022-01-11 11:10:05.137918"]]
INSERT INTO "template_terminologies" ("visit_template_id", "terminology_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["visit_template_id", 3], ["terminology_id", 1], ["created_at", "2022-01-11 11:10:05.293026"], ["updated_at", "2022-01-11 11:10:05.293026"]]
INSERT INTO "visit_templates" ("name", "created_at", "updated_at", "fee_schedule_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "test template 1"], ["created_at", "2022-01-21 12:09:11.331770"], ["updated_at", "2022-01-21 12:09:11.331770"], ["fee_schedule_id", 1]]
SELECT "template_terminologies".* FROM "template_terminologies" WHERE "template_terminologies"."visit_template_id" = $1 AND "template_terminologies"."terminology_id" = $2 ORDER BY "template_terminologies"."id" ASC LIMIT $3  [["visit_template_id", 3], ["terminology_id", 1], ["LIMIT", 1]]

  def update
    respond_to do |format|
      if @visit_template.update(visit_template_params)
        TemplateTerminology.where(visit_template_id: @visit_template.id).destroy_all
        params[:terminologies].each do |tt|
          TemplateTerminology.where(visit_template_id: @visit_template.id, terminology_id: tt.to_i).first_or_create
---
UPDATE "visit_templates" SET "name" = $1, "updated_at" = $2 WHERE "visit_templates"."id" = $3  [["name", "bbb"], ["updated_at", "2022-01-12 11:28:40.245031"], ["id", 2]]
DELETE FROM "template_terminologies" WHERE "template_terminologies"."id" = $1  [["id", 1]]
SELECT "template_terminologies".* FROM "template_terminologies" WHERE "template_terminologies"."visit_template_id" = $1 AND "template_terminologies"."id" IN ($2, $3, $4, $5, $6)  [["visit_template_id", 1], ["id", 178], ["id", 179], ["id", 180], ["id", 181], ["id", 182]]
INSERT INTO "template_terminologies" ("visit_template_id", "terminology_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["visit_template_id", 2], ["terminology_id", 1], ["created_at", "2022-01-11 11:40:07.269897"], ["updated_at", "2022-01-11 11:40:07.269897"]]
SELECT "template_terminologies".* FROM "template_terminologies" WHERE "template_terminologies"."visit_template_id" = $1 AND "template_terminologies"."terminology_id" = $2 ORDER BY "template_terminologies"."id" ASC LIMIT $3  [["visit_template_id", 1], ["terminology_id", 2], ["LIMIT", 1]]

    def set_visit_template
      @visit_template = VisitTemplate.find(params[:id])
---
SELECT "visit_templates".* FROM "visit_templates" WHERE "visit_templates"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]